examples_prescribed_oscillation/3D_RM6_oscil_surge/T12.5/constant/dynamicMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      dynamicMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include "../system/caseSetup_overset"

dynamicFvMesh       dynamicOversetFvMesh;

solver              multiSolidBodyMotionSolver;

multiSolidBodyMotionSolverCoeffs
{
   c1
   {
        #if #eval { $oscilMode == 0 }
            solidBodyMotionFunction oscillatingLinearMotion;
            oscillatingLinearMotionCoeffs
            {
                amplitude   $motionAmpV;
                omega       #eval { 2*pi()/$motionPeriod };
            }
        #elif #eval { $oscilMode == 1 }
            solidBodyMotionFunction oscillatingRotatingMotion;
            oscillatingRotatingMotionCoeffs
            {
                origin      $objCGV;
                amplitude   $motionAmpV;
                omega       #eval { 2*pi()/$motionPeriod };
            }
        #endif
    }
}

